Tekla Open API Reference for Tekla Structures 2025
PickerInputPointsWithinAView Constructor
 Creates a new PickerInputPointsWithinAView instance representing N points selected in a view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PickerInputPointsWithinAView(
	ViewBase pickedView,
	PointList pickedPoints
)
Public Sub New (
	pickedView As ViewBase,
	pickedPoints As PointList
)
Parameters
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
pickedPoints
Type: Tekla.Structures.Drawing.PointList
The list of picked points in the view coordinates.
See Also
Reference
PickerInputPointsWithinAView Class
Tekla.Structures.Drawing Namespace